cf/Documents/ПеремещениеДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПеремещениеДС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПродажаВРозницу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСБух</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведеноПоККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/ПеремещениеДС/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА

	|ВЫБРАТЬ
	|	Процесс
	|ИЗ
	|	Документ.ПеремещениеДС
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	
	// ДЕНЕЖНЫЕ СРЕДСТВА
	
	|ВЫБРАТЬ
	|	&Период						Период,
	|	&ВидДвиженияРасход			ВидДвижения,
	|	КассаОтправитель 			Касса,
	|	Сумма
	|ИЗ
	|	Документ.ПеремещениеДС
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период						Период,
	|	&ВидДвиженияПриход			ВидДвижения,
	|	КассаПолучатель 			Касса,
	|	Сумма
	|ИЗ
	|	Документ.ПеремещениеДС
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	// ОБОРОТЫ ДЕНЕЖНЫХ СРЕДСТВ
	
	|ВЫБРАТЬ
	|	&Период					КАК Период,
	|	Док.КассаПолучатель		КАК КассаСчет,
	|	Док.СтатьяДДС			КАК СтатьяДДС,
	|	ПодразделениеПолучатель Подразделение, 
	|   ОтделПолучатель Отдел,
	|   ОтделПолучатель ЦФУ,
	|	Док.Сумма				КАК Сумма, 
	|" + РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("Док.Сумма","","ВалЦен.", "ВалУпр.") + " КАК СуммаУпр
	|                          
	|ИЗ
	|	Документ.ПеремещениеДС Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ " + РаботаСКурсамиВалют.ПолучитьКурсыВалютВЗапросе("Док.КассаПолучатель.Валюта") + "
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	 &Период				КАК Период,
	|	 Док.КассаОтправитель	КАК КассаСчет,
	|	 Док.СтатьяДДС			КАК СтатьяДДС,
	|	ПодразделениеОтправитель, 
	|   ОтделОтправитель,
	|   ОтделОтправитель,
	|	-Док.Сумма				КАК Сумма,
	|" + РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("-Док.Сумма","","ВалЦен.", "ВалУпр.") + " КАК СуммаУпр
	|                          
	|ИЗ
	|	Документ.ПеремещениеДС Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ " + РаботаСКурсамиВалют.ПолучитьКурсыВалютВЗапросе("Док.КассаОтправитель.Валюта") + "
	|ГДЕ
	|	Ссылка = &Ссылка
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);	
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ДенежныеСредства",	Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ОборотыДенежныхСредств",	Пакет[3].Выгрузить());

	
КонецПроцедуры
